[
  {
    "path": "posts/welcome/",
    "title": "Welcome to OS DataMercs",
    "description": "OS DataMercs is inspired to elevate the publishing industry by consulting, encouraging and providing most recognized metadata services",
    "author": [
      {
        "name": "Olaf Schmalfuß",
        "url": "https://www.datamercs.net"
      }
    ],
    "date": "2022-02-14",
    "categories": [],
    "contents": "\r\n\r\n\r\n\r\n",
    "preview": {},
    "last_modified": "2022-02-14T22:09:59+01:00",
    "input_file": {}
  },
  {
    "path": "posts/2020-07-07-wintaskschedulerforcygwin/",
    "title": "Win Task Scheduler for cygwin",
    "description": "HowTo run bash scripts via Cygwin as Scheduled Task (i.e. \"Aufgabenplanung\") in Windows",
    "author": [
      {
        "name": "Olaf Schmalfuß",
        "url": {}
      }
    ],
    "date": "2020-07-07",
    "categories": [],
    "contents": "\r\nHowTo run bash script via Cygwin as Scheduled Task (i.e. “Aufgabenplanung”) in Windows\r\nFor process automation it is not necessary to rely on Outlook reminders if you’re on Windows and cannot (or want not) run Cron as a service to schedule scripts or programs:\r\nWindows brings its native service called “Scheduled Tasks” (or “Aufgabenplanung” in the German version)\r\nOpen “Scheduled Tasks” App\r\nhit Windows Key + R to open command prompt, enter taskschd.msc, which works regardless of Win version/ language\r\nalternatively\r\nsearch APP for either “Scheduled Task” or “Aufgabenplanung”\r\nor locate the “EXE” in C:\\Windows\\System32\\taskschd.msc\r\n…\r\n\r\nSet up a new Job\r\nRight-click on an empty space in the Tasks’ overview and select “new task” (i.e. “Einfache Aufgabe erstellen”).\r\nIn “Actions” (i.e. “Aktionen”) enter the path to cygwin in the “Program/script” field, e.g.C:\\cygwin64\\bin\\bash.exe\r\nIn the “Add arguments” box, enter “-l -c” and the full path to the bash command to run surrounded by quotes in UNIX notation, i.e. with forward slashes and as seen from within cygwin, and not simply the Windows path, e.g.-l -c \"/tmp/pdw_test/pull_chapter_report_from_jobscheduler.sh\"\r\n -l: Run as if logged on at a shell\r\n -c: Run this command\r\nIn the “Start in” field enterC:\\cygwin64\\bin\r\nAdd a description and give your task a meaningful name, so that when you come back to it in a year you know what it’s for and you’re done!\r\n\r\n\r\n\r\n\r\n\r\n\r\n",
    "preview": "posts/2020-07-07-wintaskschedulerforcygwin/example.png",
    "last_modified": "2022-02-14T17:49:27+01:00",
    "input_file": {},
    "preview_width": 1258,
    "preview_height": 839
  },
  {
    "path": "posts/2018-04-05-rbbkultur-mediathek-downloader/",
    "title": "rbbKultur - Mediathek-Downloader",
    "description": "HowTo download \"Mediathek\" features for archival purposes",
    "author": [
      {
        "name": "Olaf Schmalfuß",
        "url": {}
      }
    ],
    "date": "2018-04-05",
    "categories": [],
    "contents": "\r\nrbbKultur - Mediathek-Downloader\r\nIntroduction\r\nFor archival or educational purposes it might be useful to know how to download content from public radio and TV broadcasters’ archives, i.e. “Mediathek”.\r\n1. select Program\r\nrbbKultur - Mediathek\r\n\r\nhttps://www.kulturradio.de/zum_nachhoeren/\r\n\r\nchose date and program\r\n2. inspect element\r\ni.e. launch Developer Tools\r\nFireFox: CTRL+SHIFT+C\r\nChrome: CTRL+SHIFT+I\r\n\r\n3. Start player\r\n4. back in Developer Tools\r\nunder NETWORK right click on the File (media/ mpeg)\r\nthen Copy URL or copy as cURL\r\n5. Download via bash script\r\nadjust script\r\n\r\nrbb_downloader()\r\n  {\r\n    if [ -z \"$1\" ]\r\n      then echo \"Dateiname fehlt\"\r\n    elif [ -z \"$2\" ]\r\n      then  \"Download URL fehlt\"\r\n    else\r\n      DWNDIR=/tmp/Downloads/AlteMusik\r\n      AMDOWN=$1\r\n      rbbmediapmdp=$2\r\n      curl $rbbmediapmdp -o $DWNDIR/\"$AMDOWN\"\r\n      ls -htl $DWNDIR\r\n  fi\r\n  }\r\n  \r\n# usage:\r\nrbb_downloader \"File_Name\" \"Download_URL\"\r\n\r\noptional: save in bashrc\r\n\r\nC:\\cygwin64\\home\\schmalfuss\\.bashrc\r\n\r\nrun\r\ne.g. \r\n\r\n\r\nrbb_downloader \"Alte Musik - 2020-07-08 - Heinrich Isaac - Lieder und Motetten.mp3\" \"https://rbbmediapmdp-a.akamaihd.net/content/74/da/74da3627-5312-4f34-b681-93c48f12202d/0a858af8-b788-430b-9f5a-b5c678701a18_53d97702-265a-4586-a6d8-c8c7ad9bac80.mp3\"\r\n\r\n\r\n\r\n\r\n",
    "preview": "posts/2018-04-05-rbbkultur-mediathek-downloader/dwnfunction.png",
    "last_modified": "2022-02-14T21:33:41+01:00",
    "input_file": {},
    "preview_width": 520,
    "preview_height": 340
  },
  {
    "path": "posts/2013-07-21-a-rough-guide-to-cold-brew/",
    "title": "A rough guide to cold brew",
    "description": "While to the common librarian, Cory Doctorow is merely known as champion for Open Access, the Creative Commons, the EFF etc., he is also a hell of a barrista, introducing many a young scholar - the author included - to the carnality of cold brew.  \nSo, here is the rough guide for future reference.",
    "author": [
      {
        "name": "Olaf Schmalfuß",
        "url": "https://www.datamercs.net"
      }
    ],
    "date": "2013-07-21",
    "categories": [],
    "contents": "\r\nessential reading\r\nHOWTO attain radical hotel-room coffee independence\r\neasier\r\nCheap, easy, no-mess cold-brew coffee\r\nbut frankly: simply use your French Press and let the coffe brew over night in your fridge!\r\nA prosaic how-to, or love letter\r\nas given here to its best by Cory Doctorow, in\r\n\r\nHomeland\r\n\r\n\r\nYou’ve had hot coffee before, and in the hands of a skilled maker, coffee can be amazing. But the fact is that coffee is one of the hardest things to get right in the world. Even with great beans and a great roast and great equipment, a little too much heat, the wrong grind, or letting things go on too long will produce a cup of bitterness. Coffee’s full of different acids, and depending on the grind, temperature, roast, and method, you can “overextract” the acids from the beans, or overheat them and oxidize them, producing that awful taste you get at donut shops and Starbucks.\r\nBut there is Another Way. If you make coffee in cold water, you only extract the sweetest acids, the highly volatile flavors that hint at chocolate and caramel, the ones that boil away or turn to sourness under imperfect circumstances. Brewing coffee in cold water sounds weird, but in fact, it’s just about the easiest way to make a cup (or a jar) of coffee.\r\nJust grind coffee – keep it coarse, with grains about the size of sea salt – and combine it with twice as much water in an airtight jar. Give it a hard shake and stick it somewhere cool overnight (I used a cooler bag loaded with ice from ice camp and wrapped the whole thing in bubble wrap for insulation). In the morning, strain it through a colander and a paper coffee filter. What you’ve got now is coffee concentrate, which you can dilute with cold water to taste – I go about half and half. If you’re feeling fancy, serve it over ice.\r\nHere’s the thing: cold-brew coffee tastes amazing, and it’s practically impossible to screw it up. Unlike espresso, where all the grounds have to be about the same size so that the high pressure water doesn’t cause fracture lines in the “puck” of coffee that leave some of the coffee unextracted and the rest overextracted, cold-brew grounds can be just about any size. Seriously, you could grind it with a stone axe. Unlike drip coffee, which goes sour and bitter if you leave the grounds in contact with the water for too long, cold-brew just gets yummier and yummier (and more and more caffeinated!) the longer the grounds sit in the water. Cold-brewing in a jar is pretty much the easiest way to make coffee in the known universe – if you don’t mind waiting overnight for the brew – and it produces the best-tasting, most potent coffee you’ve ever drunk. The only downside is that it’s kind of a pain in the ass to clean up, but if you want to spend some more money, you can invest in various gadgets to make it easier to filter the grounds, from cheap little Toddy machines all the way up to hand-blown glass “Kyoto drippers” that look like something from a mad scientist’s lab. But all you need to make a perfectly astounding cup of cold-brewed jet fuel is a mason jar, coffee, water, and something to strain it through. They’ve been making iced coffee this way in New Orleans for centuries, but for some unknown reason, it never seems to have caught on big-time.\r\n[…]\r\nIt’s funny watching someone take a sip of cold-brew for the first time, because it looks and smells strong, and it is, and coffee drinkers have been trained to think that “strong” equals “bitter.” The first mouthful washes over your tongue and the coffee flavor wafts up the back of your throat and fills up your sinus cavity and your nose is all, “THIS IS INCREDIBLY STRONG!” And the flavor is strong, but there isn’t a hint of bitterness. It’s like someone took a cup of coffee and subtracted everything that wasn’t totally delicious, and what’s left behind is a pure, powerful coffee liquor made up of all these subtle flavors: citrus and cocoa and a bit of maple syrup, all overlaid on the basic and powerful coffee taste you know and love.\r\n\r\n(CC BY-NC-ND 3.0)\r\n\r\n\r\n\r\n",
    "preview": "posts/2013-07-21-a-rough-guide-to-cold-brew/cold_brew_cats.jpg",
    "last_modified": "2022-02-15T15:20:02+01:00",
    "input_file": {}
  },
  {
    "path": "posts/2013-05-23-marcedit-under-ubuntu-linux/",
    "title": "MarcEdit under Ubuntu Linux",
    "description": "HowTo install MarcEdit under Ubuntu 13.04, via Mono or Wine",
    "author": [
      {
        "name": "Olaf Schmalfuß",
        "url": "https://www.datamercs.net"
      }
    ],
    "date": "2013-05-23",
    "categories": [],
    "contents": "\r\noriginally posted here\r\nMarcEdit via MONO\r\nTerry Reese’s only install instructions for Linux on his Worklog: http://blog.reeset.net/archives/805. The mentioned “Install.txt” does not even exist in the latest iteration of MarcEdit, see the relevant part below.\r\nThere is also a tutorial on Youtube: https://www.youtube.com/watch?v=N65IHRiRby8\r\nThe following set-up was done on Ubuntu 13.04\r\n\r\n\r\n# install MonoDevelop (http://monodevelop.com/)\r\nsudo apt-get install monodevelop\r\n\r\n# create you MARC records working directory\r\nmkdir MarcRecords; cd MarcRecords\r\n\r\n# download the latest version of MarcEdit from http://marcedit.reeset.net/downloads and unzip\r\nwget http://marcedit.reeset.net/software/marcedit_other.zip; unzip marcedit_other.zip; rm marcedit_other.zip\r\n\r\n# following the MarcEdit install instructions run the following command once (also check other dependencies: http://blog.reeset.net/archives/805):\r\nmono ~/MarcRecords/marcedit_linux/linux_bootloader.exe\r\n\r\n# a permanent alias makes it easier to start MarcEditin the future\r\necho \"alias marcedit='mono ~/MarcRecords/marcedit_linux/MarcEdit.exe'\" >> ~/.bash_aliases\r\n\r\n# restart Terminal in order to activate the alias\r\n\r\n# start MarcEdit.exe via alias \"marcedit\"\r\nmarcedit\r\n\r\n# or start MarcEdit.exe via\r\nmono ~/MarcRecords/marcedit_linux/MarcEdit.exe\r\n\r\nFrom Terry Reese’s “MarcEdit Installation Instructions”:\r\n\r\nInstall.txt Last Modified: 12/28/2009\r\n\r\n\"LINUX/OTHER INSTALLATION PROCEDURE:  \r\n\r\n1.1  INSTALLATION FROM ZIP  \r\n\r\na) Ensure that the dependencies have been installed  \r\n   1) Dependency list:  \r\n      i) MONO 2.4+ (Runtime plus the System.Windows.Forms library [these are sometimes separate])  \r\n     ii) YAZ 3 + YAZ 3 develop Libraries + YAZ++ ZOOM bindings  \r\n    iii) ZLIBC libraries  \r\n     iV) libxml2/libxslt libraries  \r\nb) Unzip marcedit.zip  \r\nc) Navigate to the MarcEdit program directory and run linux_bootloader.exe (example, mono linux_bootloader.exe)  \r\nd) Yaz.Sharp.dll.config — ensure that the dllmap points to the correct version of the shared libyaz object.  \r\ne) main_icon.bmp can be used for a desktop icon  \r\nf) On first run:  \r\n   a) mono MarcEdit.exe  \r\n   b) Preferences tab will open, click on other, and set the following two values:  \r\n      i) Temp path: /tmp/  \r\n     ii) MONO path: [to your full mono path; likely /usr/bin/mono]\"  \r\nMarcEdit via WINE\r\n\r\n\r\nsudo apt-get install wine\r\n\r\nWINEPREFIX='/home/USERNAME/wine32' WINEARCH='win32' wine 'wineboot'\r\nWINEPREFIX='/home/USERNAME/wine32' bash winetricks dotnet40 corefonts\r\n\r\nwget http://marcedit.reeset.net/software/MarcEdit_Setup.msi\r\n\r\nWINEPREFIX='/home/USERNAME/wine32' msiexec /i MarcEdit_Setup.msi\r\n\r\nrm MarcEdit_Setup.msi\r\n\r\necho \"alias winmarc='WINEPREFIX='/home/USERNAME/wine32' wine /home/USERNAME/wine32/drive_c/Program\\ Files/MarcEdit\\ 5.0/MarcEdit.exe'\" >> ~/.bash_aliases\r\n\r\n# restart Terminal\r\n\r\n# start MarcEdit.exe via alias \"winmarc\"\r\nwinmarc\r\n\r\n# or start MarcEdit.exe via\r\nWINEPREFIX='/home/USERNAME/wine32' wine /home/USERNAME/wine32/drive_c/Program\\ Files/MarcEdit\\ 5.0/MarcEdit.exe\r\n\r\n\r\n\r\n\r\n",
    "preview": {},
    "last_modified": "2022-02-15T00:42:55+01:00",
    "input_file": {}
  }
]
